[
  {
    "name": "RAT",
    "descriptions": [
      "A normal sized rat. Furry, whiskers, sniffing."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Brief appearance, Brief appearance in junkyard scene, Brief appearance, environmental character, Featured creature in opening sequence, environmental character"
  },
  {
    "name": "Z",
    "descriptions": [
      "28 years old, skinny, black hair, sunglasses, black hawaiian shirt, black pants, black jacket."
    ],
    "character_type": "NAMED",
    "importance_context": "Central character who crashes the wedding, Character who reacts to the performance, Key character delivering something to Gio, Key character delivering something to Gio, tries to escape, Main character, Main character being chased, Main character being chased, appears throughout scene, Main character being pursued, Main character being pursued, appears injured, Main character in scene, Main character in scene, appears throughout, Main character in scene, survives fight and flees, Main character in the scene, Main character in the scene, appears throughout, Main character in the scene, appears to be in his room, Main character in the scene, escapes from truck, Main character in the scene, fleeing from pursuers, Main character in the yacht scene, Main character in the yacht scene, appears to be undercover, Main character introduced in sequence, Main character, appears throughout, being pursued, Main character, appears throughout, seems to be hiding from something, Main character, central to ceremony scene, Main character, driver of the ice cream truck, Main character, person being pursued, Main character, suspect in Yasim's death, Major character, Major character in scene, Major character in scene, appears throughout, seems to be deceiving about where he lives, Major character, appears in multiple scenes, Other main character, Other main character, Yasim's best friend/brother figure, Protagonist, Protagonist, appears throughout the action sequence, Protagonist, central character in scene, Protagonist, central character throughout scene, Protagonist, main character throughout scene, Protagonist, present throughout scene, dealing with mysterious past events, Protagonist, present throughout the scene, Yasim's best friend/brother figure, appears in multiple scenes, appears injured, appears throughout, appears throughout scene, appears throughout the action sequence, appears to be in his room, appears to be undercover, being pursued, central character in scene, central character throughout scene, central to ceremony scene, dealing with mysterious past events, driver of the ice cream truck, escapes from truck, fleeing from pursuers, main character throughout scene, person being pursued, present throughout scene, present throughout the scene, seems to be deceiving about where he lives, seems to be hiding from something, survives fight and flees, suspect in Yasim's death, tries to escape"
  },
  {
    "name": "GIO",
    "descriptions": [
      "44, crime boss, sinister, shadows under eyes, rough features, greasy slicked black hair, nice dark suit with sharp collars."
    ],
    "character_type": "NAMED",
    "importance_context": "Antagonist, Antagonist mentioned in backstory, Antagonist, appears in nightmare/vision sequence, Antagonist, appears to have some power over Z, Antagonist, pursuing Z in bomber, appears to be someone important/feared, Appears to be a boss/leader figure giving orders, Appears to be authority figure who ordered the mission, Appears to be the boss/authority figure, Authority figure giving orders, Authority figure giving orders to Max and Leo, Authority figure giving orders, appears to be a boss or leader, Character from flashback, Character from flashback, appears to be some kind of boss/authority figure, Criminal figure Yasim does business with, Main antagonist, Main antagonist, crime boss figure, appears throughout scene, Mentioned character, Mentioned character, someone Leo reports to, appears in nightmare/vision sequence, appears throughout scene, appears to be a boss or leader, appears to be some kind of boss/authority figure, appears to be someone important/feared, appears to have some power over Z, crime boss figure, pursuing Z in bomber, someone Leo reports to"
  },
  {
    "name": "MAX",
    "descriptions": [
      "Goon, black suit, black sunglasses, blond hair, earpiece with coiled wire."
    ],
    "character_type": "NAMED",
    "importance_context": "Antagonist, Antagonist, shooter in pursuit vehicle, Character from flashback, Character from flashback, appears to be a driver/assistant, Gio's enforcer, Main character, Main character, one of the pursuers, Minor character, Minor character, appears briefly, One of Gio's associates, One of Gio's enforcer goons, One of Gio's men, One of Gio's men, aggressive and trigger-happy, One of Gio's subordinates, Silent character present in scene with Gio, aggressive and trigger-happy, appears briefly, appears to be a driver/assistant, one of the pursuers, shooter in pursuit vehicle"
  },
  {
    "name": "LEO",
    "descriptions": [
      "Goon, black suit, black sunglasses, black buzzcut, earpiece with coiled wire."
    ],
    "character_type": "NAMED",
    "importance_context": "Antagonist, Antagonist, plants the bomb, Antagonist, pursuing driver, Main character, Main character, one of the pursuers, Minor character, Minor character connected to Gio, Minor character, appears briefly, communicates with Gio, One of Gio's associates, One of Gio's enforcer goons, One of Gio's men, One of Gio's men, actively pursuing Z, One of Gio's subordinates, Takes orders from Gio, Takes orders from Gio, appears to be an enforcer, actively pursuing Z, appears briefly, appears to be an enforcer, communicates with Gio, one of the pursuers, plants the bomb, pursuing driver"
  },
  {
    "name": "HOMELESS GUY",
    "descriptions": [
      "Homeless bum wearing layers of ragged clothing, ripped thick jacket, ripped jeans, beanie over unkempt hair, beard, not handsome."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Ceremonial leader, Ceremonial leader, significant speaking role, Minor character with one line, Musical performer in scene, Supporting character, Supporting character, one of the main goons, Thief stealing from Z's car, one of the main goons, significant speaking role"
  },
  {
    "name": "MIKE",
    "descriptions": [
      "Dirty sunbeaten homeless guy wearing a dirty white t-shirt and black athletic pants."
    ],
    "character_type": "NAMED",
    "importance_context": "Accomplice to Homeless Guy, Supporting character, Supporting character in musical scene, Supporting character, assists in ceremony, Supporting character, one of the main goons, assists in ceremony, one of the main goons"
  },
  {
    "name": "ANTON",
    "descriptions": [
      "Fat bald goon wearing a suit and tie, sunglasses, earpiece."
    ],
    "character_type": "NAMED",
    "importance_context": "One of Gio's goons, One of Gio's goons, driver, driver"
  },
  {
    "name": "ROLPH",
    "descriptions": [
      "Goon with slicked black hair, sunglasses, earpiece, wearing a suit, neck tattoo."
    ],
    "character_type": "NAMED",
    "importance_context": "Minor character who gets killed, One of Gio's goons"
  },
  {
    "name": "CHEF",
    "descriptions": [
      "Fat, old and tall wearing a white apron and chef's hat. Serious and tough."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Background character in pantry scene, Kitchen scene character who tries to stop Leo"
  },
  {
    "name": "HOSTESS",
    "descriptions": [
      "Pretty blond woman in heels and a professional dress."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Minor character in restaurant scene"
  },
  {
    "name": "ICE CREAM MAN",
    "descriptions": [
      "70s, Italian, fat, a sun-beaten old man with a white mustache wearing a white ice cream truck driver uniform with a driver's cap and bowtie."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Helps Z escape, Helps Z escape, dies in explosion, Major character, Major character, owner/operator of the special ice cream truck, Major supporting character, Major supporting character, helps Z escape, pilots flying ice cream truck, Mentor/guide figure in drugstore scene, Significant character in chase sequence, Supporting character who directs Z through the hatch, dies in explosion, helps Z escape, owner/operator of the special ice cream truck, pilots flying ice cream truck"
  },
  {
    "name": "KIDS",
    "descriptions": [
      "A group of neighborhood kids wearing normal summer clothes."
    ],
    "character_type": "GROUP",
    "importance_context": "Group present during ice cream truck scene"
  },
  {
    "name": "LINE COOKS",
    "descriptions": [
      "Line cooks wearing chef uniforms, no chef hats."
    ],
    "character_type": "GROUP",
    "importance_context": "Background characters in kitchen scene"
  },
  {
    "name": "DISHWASHERS",
    "descriptions": [
      "Dishwashers wearing hair nets and t shirts and jeans."
    ],
    "character_type": "GROUP",
    "importance_context": "Background characters in kitchen scene"
  },
  {
    "name": "DINERS",
    "descriptions": [
      "Diners at a nice Italian restaurant."
    ],
    "character_type": "GROUP",
    "importance_context": "Restaurant patrons during shooting scene"
  },
  {
    "name": "PILOT",
    "descriptions": [
      "Pilot with an oxygen mask and visor. Face is not visible behind all that stuff."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Minor character who reports mission completion, Reports mission completion"
  },
  {
    "name": "BRIDE",
    "descriptions": [
      "Bride, blonde, beautiful, white wedding dress."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Background character in wedding scene, One of the main characters in wedding scene"
  },
  {
    "name": "GROOM",
    "descriptions": [
      "Groom with a suit and bowtie, happy, rugged."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Background character in wedding scene, One of the main characters in wedding scene"
  },
  {
    "name": "FRANCISCO",
    "descriptions": [
      "Winery owner, nice suit with an ascot, buttoned down shirt, nice pants, stylish hair."
    ],
    "character_type": "NAMED",
    "importance_context": "Wedding officiant and vineyard owner"
  },
  {
    "name": "GROOM'S MOTHER",
    "descriptions": [
      "Groom's mother at a wedding, nice dress, pearl necklace, middle aged."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Minor character at wedding"
  },
  {
    "name": "BRIDE'S FATHER",
    "descriptions": [
      "Bride's father, suit and tie, watch, old but tough."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Supporting character at wedding"
  },
  {
    "name": "HANK",
    "descriptions": [
      "30s, Bride's brother, tough guy in a tux, buzz cut."
    ],
    "character_type": "NAMED",
    "importance_context": "Major character in scene, Major character in scene, appears throughout interaction with Z, Minor character in opening scene, Significant character in wedding scene, Significant character in wedding scene, confronts then befriends Z, appears throughout interaction with Z, confronts then befriends Z"
  },
  {
    "name": "YOHAN",
    "descriptions": [
      "28, blond, Z's brother, wearing a white Hawaiian shirt, shorts, sandals."
    ],
    "character_type": "NAMED",
    "importance_context": "Character in yard scene, Character looking for Z, Important character, Important character, Z's brother, appears in phone conversation, Major character, Major character, Z's brother, lives in the house, Minor character in yard scene, Z's brother, appears in phone conversation, lives in the house"
  },
  {
    "name": "LOGAN",
    "descriptions": [
      "28, scruffy stoner wearing a jersey and sweatpants."
    ],
    "character_type": "NAMED",
    "importance_context": "Character in yard scene, Minor character in yard scene, Supporting character, Supporting character, friend in the house, friend in the house"
  },
  {
    "name": "JONNO",
    "descriptions": [
      "28, Australian, lanky, wearing a tank top and gym shorts, sandals, playful and mischievious."
    ],
    "character_type": "NAMED",
    "importance_context": "Character in yard scene, Character in yard scene, instigating action with dead rat, Minor character in yard scene, Supporting character, Supporting character, friend in the house, friend in the house, instigating action with dead rat"
  },
  {
    "name": "KAYLA",
    "descriptions": [
      "26, goth, black clothes, really hot."
    ],
    "character_type": "NAMED",
    "importance_context": "Mentioned character involved in conflict between Z and Yohan, Minor character, Minor character, appears briefly, Speaking character in emotional distress, Supporting character, Supporting character, creates conflict through relationship with Z and Yohan, appears briefly, creates conflict through relationship with Z and Yohan"
  },
  {
    "name": "CATHERINE",
    "descriptions": [
      "angry, middle-aged woman wearing yoga pants and a cardigan"
    ],
    "character_type": "NAMED",
    "importance_context": "Minor antagonist, Minor antagonist, complaining neighbor, complaining neighbor"
  },
  {
    "name": "COOL SPY",
    "descriptions": [
      "shown on poster with explosion, planes, villains, allies and beautiful women, staring into space, tuxedo, gun, sunglasses."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Visual element in poster on wall"
  },
  {
    "name": "Z'S MOM",
    "descriptions": [
      "middle aged mom wearing jeans and a t-shirt, kind."
    ],
    "character_type": "NAMED",
    "importance_context": "Supporting character, Supporting character, appears in memory/dream sequence, appears in memory/dream sequence"
  },
  {
    "name": "CHRISTINE",
    "descriptions": [
      "27, curly hair, glasses, pretty nerd."
    ],
    "character_type": "NAMED",
    "importance_context": "Character from flashback, Character from flashback, appears to be Z's ex, Supporting character, Supporting character, appears to be Z's former love interest, appears to be Z's ex, appears to be Z's former love interest"
  },
  {
    "name": "JUNK WARDEN",
    "descriptions": [
      "Junk warden, fat, old, leather jacket, mean."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Authority figure in the junkyard, Authority figure in the junkyard, provides information to Z, Minor character who provides information about location, provides information to Z"
  },
  {
    "name": "DOG",
    "descriptions": [
      "Old dog wearing a bandana tied around its neck. Sleepy."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Background character, Background character, adds to scene setting, adds to scene setting"
  },
  {
    "name": "DRIVER",
    "descriptions": [
      "Uber driver, middle eastern, athletic jumpsuit."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Brief appearance, Brief appearance, refuses to give Z a ride, refuses to give Z a ride"
  },
  {
    "name": "YASIM",
    "descriptions": [
      "Middle-Eastern, 28, buff, wearing a gold chain and expensive street-wear"
    ],
    "character_type": "NAMED",
    "importance_context": "Antagonist in fight scene, Antagonist in fight scene, dies during confrontation, Antagonist who dies in fight with Z, Deceased character, Deceased character, victim, Main character, Main character, fashion designer hosting release party, Major character, Major character, owns the house where scene takes place, Supporting character, Supporting character who appears at the end to help Z, Supporting character, friend of Z, Supporting character, gives Z a ride, appears throughout scene, Supporting character, has fashion show, appears throughout scene, dies during confrontation, fashion designer hosting release party, friend of Z, gives Z a ride, has fashion show, owns the house where scene takes place, victim"
  },
  {
    "name": "LANDSCAPERS",
    "descriptions": [
      "Landscapers wearing typical gardeners' uniforms."
    ],
    "character_type": "GROUP",
    "importance_context": "Background characters, Background characters in brief interaction, Background characters in brief scene"
  },
  {
    "name": "VALERIE",
    "descriptions": [
      "23, heavy makeup, perfect blonde hair, model, big boobs, skinny."
    ],
    "character_type": "NAMED",
    "importance_context": "Supporting character, Supporting character, also referred to as Val, Yasim's complicated love interest, Yasim's girlfriend, Yasim's girlfriend, source of drama, also referred to as Val, source of drama"
  },
  {
    "name": "REPORTER",
    "descriptions": [
      "29, woman reporter wearing business casual"
    ],
    "character_type": "UNNAMED",
    "importance_context": "News reporter covering a story, Off-screen voice providing news"
  },
  {
    "name": "ARMY OFFICER",
    "descriptions": [
      "35, serious guy with a buzz cut and aviator sunglasses, veteran."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Interviewed about the incident, Off-screen voice providing commentary"
  },
  {
    "name": "SUPERMODELS",
    "descriptions": [
      "Beautiful male and female supermodels wearing black streetwear with YASIM on it in white letters."
    ],
    "character_type": "GROUP",
    "importance_context": "Fashion show models, Models in fashion show sequence"
  },
  {
    "name": "BIG DEAL",
    "descriptions": [
      "Rapper, black, african american, fat, gold chain, black jersey with YASIM written on it in white letters, oversized shorts."
    ],
    "character_type": "NAMED",
    "importance_context": "Antagonist pursuing Z, Leader of group pursuing Z, Main antagonist, Main antagonist, leader figure who shoots at Z, Performer at Yasim's party, leader figure who shoots at Z"
  },
  {
    "name": "MR. ABDUL",
    "descriptions": [
      "Yasim's father, middle eastern, middle aged, fat, rich, lots of gold rings, bald, glasses, wearing a black shirt with YASIM on it in white letters under his suit jacket."
    ],
    "character_type": "NAMED",
    "importance_context": "Yasim's father"
  },
  {
    "name": "MRS. ABDUL",
    "descriptions": [
      "Yasim's mother, middle aged, rich, very fit, middle eastern, wearing expensive jewelry, yoga pants, and a black crop top with YASIM written on it in white letters."
    ],
    "character_type": "NAMED",
    "importance_context": "Yasim's mother"
  },
  {
    "name": "CHAD",
    "descriptions": [
      "Handsome, buff, brown fade cut with slicked hair, wearing black pants and a black shirt with YASIM on it in white letters."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Party guest who dances with Val"
  },
  {
    "name": "DJ",
    "descriptions": [
      "Big Deal's DJ, hoodie with the hood up, hunched over a laptop."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Background character at party, Stops Big Deal from continuing to shoot"
  },
  {
    "name": "CROWD",
    "descriptions": [
      "Crowd of people all wearing black shirts with YASIM on them in white letters."
    ],
    "character_type": "GROUP",
    "importance_context": "Mass of people pursuing Z after Yasim's death, Witnesses to the fight who chase after Z"
  },
  {
    "name": "NED",
    "descriptions": [
      "40s. Brooklyn accent. DeMarco Brother, baseball cap with N on it, short and fat, overalls, white shirt, holding a plunger, wearing gloves."
    ],
    "character_type": "NAMED",
    "importance_context": "Appears at end of scene as apparent antagonist to cult, Character in ceremony scene, Character involved in action sequence, One of two plumber brothers hunting the Rat King, Supporting character exploring sewers"
  },
  {
    "name": "JEFFREY",
    "descriptions": [
      "40s, Brooklyn accent, DeMarco Brother, baseball cap with J on it, tall and skinny, black shirt, wearing overalls, wielding a flamethrower."
    ],
    "character_type": "NAMED",
    "importance_context": "Appears at end of scene as apparent antagonist to cult, Character in ceremony scene, Character involved in action sequence, One of two plumber brothers hunting the Rat King, Supporting character exploring sewers"
  },
  {
    "name": "RAT KING",
    "descriptions": [
      "A giant disgusting slobbering mutant royal rat wearing a crown and robe, holding a royal scepter. Evil."
    ],
    "character_type": "NAMED",
    "importance_context": "Antagonist, Antagonist, leader of the sewer dwelling group, Authority figure giving orders to goons, Leader figure, Leader figure, appears to be controlling the cult, Mysterious unseen character speaking to Z, Unseen antagonist that the DeMarco Brothers are hunting, appears to be controlling the cult, leader of the sewer dwelling group"
  },
  {
    "name": "goons",
    "descriptions": [
      "A bunch of homeless goons in the employ of the rat king."
    ],
    "character_type": "GROUP",
    "importance_context": "Collective group of cult members, Collective group of sewer dwellers, Ensemble group performing in scene, Rat King's subordinates, The Rat King's followers"
  },
  {
    "name": "COP 1",
    "descriptions": [
      "A skinny male police officer."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Background character in street scene, Minor character in brief street scene"
  },
  {
    "name": "COP 2",
    "descriptions": [
      "A fat male police officer."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Background character in street scene, Minor character in brief street scene"
  },
  {
    "name": "GOON 3",
    "descriptions": [
      "A homeless guy with an eyepatch and missing hair."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Minor character, Minor character, part of the sewer group, Minor speaking role, part of the sewer group"
  },
  {
    "name": "ANCHOR",
    "descriptions": [
      "Female news anchor."
    ],
    "character_type": "UNNAMED",
    "importance_context": "News anchor reporting on Yasim's death"
  },
  {
    "name": "DWEEB",
    "descriptions": [
      "Some dweeb. Annoying nerd. Star shaped sunglasses."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Enthusiastic party-goer who interacts with Z"
  },
  {
    "name": "LEX",
    "descriptions": [
      "blond dude in a captain's uniform with no shirt, six-pack abs."
    ],
    "character_type": "NAMED",
    "importance_context": "Event host/speaker, Event host/speaker, energizing the crowd, Host/MC of the yacht party, energizing the crowd"
  },
  {
    "name": "CUTE GIRL",
    "descriptions": [
      "Cute girl with black bangs wearing an anime shirt and tight jeans."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Love interest/romantic scene with Z, Potential love interest for Z at the end of the scene"
  },
  {
    "name": "DELIVERY GUYS",
    "descriptions": [
      "A couple delivery guys."
    ],
    "character_type": "GROUP",
    "importance_context": "Background characters entering the yacht"
  },
  {
    "name": "PARTY CROWD",
    "descriptions": [
      "gorgeous influencers, chic hipsters and strange nerds"
    ],
    "character_type": "GROUP",
    "importance_context": "Background characters at the yacht party"
  },
  {
    "name": "MAYOR",
    "descriptions": [
      "The city mayor. Slick politician."
    ],
    "character_type": "UNNAMED",
    "importance_context": "Official in ceremony scene"
  }
]